Курс_Бухгалтерские_задачи/src/Documents/Операция/Операция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Операция</name>
  <posting>Deny</posting>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Курс_Бухгалтерские_задачи/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Курс_Бухгалтерские_задачи/src/Documents/Операция/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не ЭтоНовый() И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		Движения.Проводки.Записывать = Истина;
		Движения.Проводки.Прочитать();
		Движения.Проводки.УстановитьАктивность(НЕ ПометкаУдаления);			
	КонецЕсли;
	
	
	Если НЕ Движения.Проводки.Количество() = 0  Тогда
		Для каждого Проводка Из Движения.Проводки Цикл
			Проводка.Период = Дата;
			Проводка.Организация = Организация;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ОбъектКопирования.Движения.Проводки.Прочитать();
	Для каждого ИсхЗапись Из ОбъектКопирования.Движения.Проводки Цикл
		Проводка = Движения.Проводки.Добавить();
		ЗаполнитьЗначенияСвойств(Проводка, ИсхЗапись);
	КонецЦикла;
КонецПроцедуры
